payment_systems_bins = {
    "Мир": {
        "СберБанк": ["220100","220220"],
        "Т-Банк": ["220070"],
        "ВТБ": ["220024","220065","220224"],
        "Альфа-Банк": ["220015"],
        "Газпромбанк": ["220056"],
        "Райффайзенбанк": ["220030"]
    },
    "Visa": {
        "СберБанк": ["402333", "417398", "417638"],
        "Т-Банк": ["437772", "437773", "437783"],
        "ВТБ": ["404007", "405541", "405676"],
        "Альфа-Банк": ["408396", "408397", "410584"],
        "Газпромбанк": ["404136", "404270"],
        "Райффайзенбанк": ["402179", "404807"]
    },
    "Mastercard": {
        "СберБанк": ["522860", "527404", "530829"],
        "Т-Банк": ["513990", "518901", "521324"],
        "ВТБ": ["510177", "510410", "511178"],
        "Альфа-Банк": ["521178", "548981", "518742"],
        "Газпромбанк": ["511223", "512347"],
        "Райффайзенбанк": ["508406", "510069"]
    }
}

payment_system_coefficients = {
    "Мир": 0,
    "Visa": 100,
    "Mastercard": 0
}

bank_coefficients = {
    "СберБанк": 0,
    "Т-Банк": 0,
    "ВТБ": 0,
    "Альфа-Банк": 0,
    "Газпромбанк": 100,
    "Райффайзенбанк": 0
}